; domain
;; source: https://github.com/AI-Planning/pddl-generators/blob/main/rovers/domain.pddl
;; updates:
;;   - since actions are performed sequentially and immediately
;;     'channel_free' and 'available' predicates are removed
;;   -

(define (domain rover)
(:requirements :strips :typing)
(:types rover waypoint store camera mode lander objective)

(:predicates
    (at ?x - rover ?y - waypoint)
    (at_lander ?x - lander ?y - waypoint)
    (can_traverse ?r - rover ?x - waypoint ?y - waypoint)
	(equipped_for_soil_analysis ?r - rover)
    (equipped_for_rock_analysis ?r - rover)
    (equipped_for_imaging ?r - rover)
    (empty ?s - store)
    (have_rock_analysis ?r - rover ?w - waypoint)
    (have_soil_analysis ?r - rover ?w - waypoint)
    (full ?s - store)
	(calibrated ?c - camera ?r - rover)
	(supports ?c - camera ?m - mode)
    (visible ?w - waypoint ?p - waypoint)
    (have_image ?r - rover ?o - objective ?m - mode)
    (communicated_soil_data ?w - waypoint)
    (communicated_rock_data ?w - waypoint)
    (communicated_image_data ?o - objective ?m - mode)
	(at_soil_sample ?w - waypoint)
	(at_rock_sample ?w - waypoint)
    (visible_from ?o - objective ?w - waypoint)
	(store_of ?s - store ?r - rover)
	(calibration_target ?i - camera ?o - objective)
	(on_board ?i - camera ?r - rover)
)

(:action navigate
:parameters (?x - rover ?y - waypoint ?z - waypoint)
:precondition (and
    (can_traverse ?x ?y ?z)
    (at ?x ?y)
    (visible ?y ?z))
:effect (and
    (not (at ?x ?y))
    (at ?x ?z))
)

(:action sample_soil
:parameters (?x - rover ?s - store ?p - waypoint)
:precondition (and
    (at ?x ?p)
    (at_soil_sample ?p)
	(equipped_for_soil_analysis ?x)
	(store_of ?s ?x)
	(empty ?s))
:effect (and
    (not (empty ?s))
    (full ?s)
    (have_soil_analysis ?x ?p)
    (not (at_soil_sample ?p)))
)

(:action sample_rock
:parameters (?x - rover ?s - store ?p - waypoint)
:precondition (and
    (at ?x ?p)
    (at_rock_sample ?p)
	(equipped_for_rock_analysis ?x)
	(store_of ?s ?x)
	(empty ?s))
:effect (and
    (not (empty ?s))
    (full ?s)
    (have_rock_analysis ?x ?p)
	(not (at_rock_sample ?p)))
)

(:action drop
:parameters (?x - rover ?y - store)
:precondition (and
    (store_of ?y ?x)
    (full ?y))
:effect (and
    (not (full ?y))
    (empty ?y))
)

(:action calibrate
 :parameters (?r - rover ?i - camera ?t - objective ?w - waypoint)
 :precondition (and
    (equipped_for_imaging ?r)
    (calibration_target ?i ?t)
    (at ?r ?w)
    (visible_from ?t ?w)
    (on_board ?i ?r))
 :effect (and
    (calibrated ?i ?r))
)

(:action take_image
 :parameters (?r - rover ?p - waypoint ?o - objective ?i - camera ?m - mode)
 :precondition (and
    (calibrated ?i ?r)
    (on_board ?i ?r)
    (equipped_for_imaging ?r)
    (supports ?i ?m)
    (visible_from ?o ?p)
    (at ?r ?p))
 :effect (and
    (have_image ?r ?o ?m)
    (not (calibrated ?i ?r)))
)

(:action communicate_soil_data
 :parameters (?r - rover ?l - lander ?p - waypoint ?x - waypoint ?y - waypoint)
 :precondition (and
    (at ?r ?x)
    (at_lander ?l ?y)
    (have_soil_analysis ?r ?p)
    (visible ?x ?y))
 :effect (and
    (communicated_soil_data ?p))
)

(:action communicate_rock_data
 :parameters (?r - rover ?l - lander ?p - waypoint ?x - waypoint ?y - waypoint)
 :precondition (and
    (at ?r ?x)
    (at_lander ?l ?y)
    (have_rock_analysis ?r ?p)
    (visible ?x ?y))
 :effect (and
    (communicated_rock_data ?p))
)

(:action communicate_image_data
 :parameters (?r - rover ?l - lander ?o - objective ?m - mode
	      ?x - waypoint ?y - waypoint)
 :precondition (and
    (at ?r ?x)
    (at_lander ?l ?y)
    (have_image ?r ?o ?m)
    (visible ?x ?y))
 :effect (and
    (communicated_image_data ?o ?m)))
)

; problem
;; rovers=1, waypoints=5, cameras=1, objectives=3, out_folder=training/easy, instance_id=28, seed=63

(define (problem rover-28)
 (:domain rover)
 (:objects 
    general - lander
    colour high_res low_res - mode
    rover1 - rover
    rover1store - store
    waypoint1 waypoint2 waypoint3 waypoint4 waypoint5 - waypoint
    camera1 - camera
    objective1 objective2 objective3 - objective)
 (:init 
    (at_lander general waypoint4)
    (at rover1 waypoint4)
    (equipped_for_soil_analysis rover1)
    (equipped_for_rock_analysis rover1)
    (equipped_for_imaging rover1)
    (empty rover1store)
    (store_of rover1store rover1)
    (at_rock_sample waypoint1)
    (at_rock_sample waypoint3)
    (at_rock_sample waypoint4)
    (at_rock_sample waypoint5)
    (at_soil_sample waypoint2)
    (at_soil_sample waypoint4)
    (at_soil_sample waypoint5)
    (visible waypoint1 waypoint3)
    (visible waypoint3 waypoint1)
    (visible waypoint5 waypoint4)
    (visible waypoint1 waypoint4)
    (visible waypoint4 waypoint5)
    (visible waypoint2 waypoint5)
    (visible waypoint4 waypoint1)
    (visible waypoint5 waypoint2)
    (visible waypoint1 waypoint2)
    (visible waypoint2 waypoint1)
    (can_traverse rover1 waypoint1 waypoint3)
    (can_traverse rover1 waypoint3 waypoint1)
    (can_traverse rover1 waypoint5 waypoint4)
    (can_traverse rover1 waypoint1 waypoint4)
    (can_traverse rover1 waypoint4 waypoint5)
    (can_traverse rover1 waypoint2 waypoint5)
    (can_traverse rover1 waypoint4 waypoint1)
    (can_traverse rover1 waypoint5 waypoint2)
    (calibration_target camera1 objective3)
    (on_board camera1 rover1)
    (supports camera1 high_res)
    (supports camera1 colour)
    (supports camera1 low_res)
    (visible_from objective1 waypoint2)
    (visible_from objective1 waypoint4)
    (visible_from objective1 waypoint3)
    (visible_from objective1 waypoint5)
    (visible_from objective1 waypoint1)
    (visible_from objective2 waypoint3)
    (visible_from objective2 waypoint1)
    (visible_from objective2 waypoint4)
    (visible_from objective3 waypoint5)
    (visible_from objective3 waypoint1)
    (visible_from objective3 waypoint2)
    (visible_from objective3 waypoint4))
 (:goal  (and 
    
    (communicated_soil_data waypoint4)
    (communicated_image_data objective2 colour)
    (communicated_image_data objective3 low_res)
    (communicated_image_data objective2 high_res)
    (communicated_image_data objective1 low_res)
    (communicated_image_data objective1 colour))))

; plan
1. (calibrate rover1 camera1 objective3 waypoint4)
   added: (calibrated camera1 rover1)
   goals met: 0 of 6
2. (sample_soil rover1 rover1store waypoint4)
   deleted: (empty rover1store) (at_soil_sample waypoint4)
   added: (full rover1store) (have_soil_analysis rover1 waypoint4)
   goals met: 0 of 6
3. (navigate rover1 waypoint4 waypoint1)
   deleted: (at rover1 waypoint4)
   added: (at rover1 waypoint1)
   goals met: 0 of 6
4. (communicate_soil_data rover1 general waypoint4 waypoint1 waypoint4)
   added: (communicated_soil_data waypoint4)
   goals met: 1 of 6
5. (take_image rover1 waypoint1 objective2 camera1 colour)
   deleted: (calibrated camera1 rover1)
   added: (have_image rover1 objective2 colour)
   goals met: 1 of 6
6. (calibrate rover1 camera1 objective3 waypoint1)
   added: (calibrated camera1 rover1)
   goals met: 1 of 6
7. (take_image rover1 waypoint1 objective2 camera1 high_res)
   deleted: (calibrated camera1 rover1)
   added: (have_image rover1 objective2 high_res)
   goals met: 1 of 6
8. (communicate_image_data rover1 general objective2 colour waypoint1 waypoint4)
   added: (communicated_image_data objective2 colour)
   goals met: 2 of 6
9. (communicate_image_data rover1 general objective2 high_res waypoint1 waypoint4)
   added: (communicated_image_data objective2 high_res)
   goals met: 3 of 6
10. (calibrate rover1 camera1 objective3 waypoint1)
   added: (calibrated camera1 rover1)
   goals met: 3 of 6
11. (take_image rover1 waypoint1 objective1 camera1 colour)
   deleted: (calibrated camera1 rover1)
   added: (have_image rover1 objective1 colour)
   goals met: 3 of 6
12. (communicate_image_data rover1 general objective1 colour waypoint1 waypoint4)
   added: (communicated_image_data objective1 colour)
   goals met: 4 of 6
13. (calibrate rover1 camera1 objective3 waypoint1)
   added: (calibrated camera1 rover1)
   goals met: 4 of 6
14. (take_image rover1 waypoint1 objective1 camera1 low_res)
   deleted: (calibrated camera1 rover1)
   added: (have_image rover1 objective1 low_res)
   goals met: 4 of 6
15. (communicate_image_data rover1 general objective1 low_res waypoint1 waypoint4)
   added: (communicated_image_data objective1 low_res)
   goals met: 5 of 6
16. (calibrate rover1 camera1 objective3 waypoint1)
   added: (calibrated camera1 rover1)
   goals met: 5 of 6
17. (take_image rover1 waypoint1 objective3 camera1 low_res)
   deleted: (calibrated camera1 rover1)
   added: (have_image rover1 objective3 low_res)
   goals met: 5 of 6
18. (communicate_image_data rover1 general objective3 low_res waypoint1 waypoint4)
   added: (communicated_image_data objective3 low_res)
   goals met: 6 of 6
